unit U64BitTester;
//------------------------------------------------------------------------------
// резервирует всю память ниже 4 гигабай для 64-битных приложений
//  все адреса априори получаются больше Cardinal
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
interface

//------------------------------------------------------------------------------
implementation

uses
  Windows;

//------------------------------------------------------------------------------
//! забиваем всю нижнуюю память
//------------------------------------------------------------------------------
procedure ReserveMem;
{$IFDEF Win64}
var
  //!
  P: Pointer;
//------------------------------------------------------------------------------
begin
  while True do
  begin
    P := VirtualAlloc(nil, 1024 * 1024, MEM_RESERVE, PAGE_NOACCESS);
    if not Assigned(P) then
      Break;
    if (NativeUInt(P) >= High(Cardinal)) then
      Break;
  end;
end;
{$ELSE}
begin
end;
{$ENDIF}

//------------------------------------------------------------------------------
initialization
  ReserveMem;

end.

