unit E_UtilsFiles;
//------------------------------------------------------------------------------
// Модуль подпрограмм манипуляций с файловыми именами
//------------------------------------------------------------------------------
// Содержит утилиты по выделению отдельных частей ФС
// Работает только с путями Windows
// Есть калька стандартых из SysUtils, но эти должны работать быстрее (по идее)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
interface

uses
  SysUtils,
  C_FileNames;

//------------------------------------------------------------------------------
//! получить имя файла (*** и путь, если есть) без расширения и точки
//! -> ищет последнюю точку и возвращает строку до неё
//! возвращает неизменную строку, если точка не найдена
//------------------------------------------------------------------------------
function QExcludeFileExt(
  const AFullName: string
): string;

//------------------------------------------------------------------------------
//! получить расширение файла без точки
//! -> ищет последнюю точку и возвращает строку после неё
//! возвращает неизменную строку, если точка не найдена
//------------------------------------------------------------------------------
function QExtractFileExt(
  const AFullName: string
): string;

//------------------------------------------------------------------------------
//! получить имя файла с расширением из полного пути файла
//! -> ищет последнюю наклонную и возвращает строку после неё
//! возвращает неизменную строку, если наклонная не найдена
//------------------------------------------------------------------------------
function QExcludeFilePath(
  const AFullPath: string
): string;

//------------------------------------------------------------------------------
//! получить путь к папке из полного пути файла
//! -> ищет последнюю наклонную и возвращает строку по неё (*** включая наклонную)
//! возвращает неизменную строку, если наклонная не найдена
//------------------------------------------------------------------------------
function QExtractFilePath(
  const AFullPath: string
): string;

//------------------------------------------------------------------------------
implementation

function QExcludeFileExt(
  const AFullName: string
): string;
var
  //!
  I: Integer;
//------------------------------------------------------------------------------
begin
  for I := Length( AFullName ) downto 1 do
  begin
    if ( AFullName[I] = CExtDelim ) then Exit( Copy( AFullName, 1, I - 1 ) );
  end;
  Result := AFullName;
end;

function QExtractFileExt(
  const AFullName: string
): string;
var
  //!
  I: Integer;
//------------------------------------------------------------------------------
begin
  for I := Length( AFullName ) downto 1 do
  begin
    if ( AFullName[I] = CExtDelim ) then Exit( Copy( AFullName, I + 1, MaxInt ) );
  end;
  Result := AFullName;
end;

function QExcludeFilePath(
  const AFullPath: string
): string;
var
  //!
  I: Integer;
//------------------------------------------------------------------------------
begin
  for I := Length( AFullPath ) downto 1 do
  begin
    if ( AFullPath[I] = CPathDelim ) then Exit( Copy( AFullPath, I + 1, MaxInt ) );
  end;
  Result := AFullPath;
end;

function QExtractFilePath(
  const AFullPath: string
): string;
var
  //!
  I: Integer;
//------------------------------------------------------------------------------
begin
  for I := Length( AFullPath ) downto 1 do
  begin
    if ( AFullPath[I] = CPathDelim ) then Exit( Copy( AFullPath, 1, I ) );
  end;
  Result := AFullPath;
end;

end.

